{
  "track_id": "nexus_branding_20260127",
  "type": "feature",
  "status": "new",
  "created_at": "2026-01-27T10:00:00Z",
  "updated_at": "2026-01-27T10:00:00Z",
  "description": "1. Change the name “AI Center of Excellence” to “Nexus” in landing page and navbar, change AI/ML to just AI in the newsletter page, 2. Add a new pillar in the landing page named “Internal AI Adoption & Automation” with image: https://storage.googleapis.com/aiml-coe-web-app/pillars-landing/ai-adoption.jpg in the Strategic pillar section - so total pillars will be 7 pillars. 3. Change the name of the pillar ‘COE Delivery Goverance’ to ‘Engagement & Continuous Improvement’ 4. In the newsletter page, there are two blogs. One is future-of-ai-in-enterprise and other is ‘staples-mlops-success-story’ . Make the staples-mlops-success-story as featured as well. In the all articles section ‘All Posts’ filter correctly shows two articles in the selector button but renders only staples story below. Clicking on Gen AI tag renders no article. 5. In the newsletter page, keep only the tags for which the article is available. In this case, remove AgentOps, Security. Make it such tha tag will automatically show that tag filter here. 6.In the test-email page, In tech updates add Point about TaxMate. Context: With the January 17th deadline for Investment Proof submission for Jan 2026 payroll is fast approaching, we understand that navigating tax guidelines can be a bit overwhelming. To support you during this critical filing window, the AIML Centre of Excellence (CoE) has developed an intelligent AI Tax Assistant – TaxMate, designed to help simplify your tax-related queries. How TaxMate can help you: • Clarify valid proofs for Investment Declarations (80C, 80D, etc.) • Answer queries on specific claims such as NPS, HRA, Children’s Education Allowance, and more • Guide you on Darwinbox upload requirements, including accepted file formats and size limits ￼ Try the AI Assistant here: TaxMate Remove the Resources & Learning section. Add a new section below Success Stories showing articles under particular tag from the newsletter page with just name and linsletter email creation automated at least for the blog part. Remove linkedinm twitter, website from the newsletter email 7. Add a new success story of ‘Interactive demo hub’ to explain the hub's functionality 8. Is it possible to create the HTML page of the email template: frontend/app/newsletter/test-email/template.html directly from code and existing blogs assuming that the automation in Task no, 6 is correctly working. These can be inter connected. I just don’t want to manually create this html again."
}